
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>CSS Houdini和样式的未来 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    2019 JS Conf
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    1.Una Kravets
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="UnaKravets.html">
            
                <a href="UnaKravets.html">
            
                    
                    CSS Houdini和样式的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2.Sher Minn Chong
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="SherMinnChong.html">
            
                <a href="SherMinnChong.html">
            
                    
                    用JS重新创造计算机复古艺术
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >CSS Houdini和样式的未来</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="css-houdini&#x548C;&#x6837;&#x5F0F;&#x7684;&#x672A;&#x6765;">CSS Houdini&#x548C;&#x6837;&#x5F0F;&#x7684;&#x672A;&#x6765;</h2>
<blockquote>
<p><strong>PS&#xFF1A;</strong>PPT&#x622A;&#x56FE;&#x4E0D;&#x5168;&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x76F4;&#x63A5;&#x89C2;&#x770B;&#x89C6;&#x9891;&#x3002;<br>
<strong>&#x6F14;&#x8BB2;&#x8005;&#xFF1A;</strong><a href="https://twitter.com/una" target="_blank">Una Kravets</a>&#x4F5C;&#x4E3A;IBM Design&#x548C;Bluemix&#xFF08;&#x4E24;&#x4E2A; IBM &#x4EA7;&#x54C1;&#xFF09;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#xFF0C;&#x8FD8;&#x4E3B;&#x6301;@toolsday&#x548C;STEMinist&#x4E24;&#x4E2A;&#x64AD;&#x5BA2;&#xFF0C;&#x4ECE;&#x521B;&#x9020;&#x6027;&#x548C;&#x5B9E;&#x7528;&#x6027;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x5230;&#x4FC3;&#x8FDB;&#x793E;&#x533A;&#x5F00;&#x6E90;&#x72B6;&#x6001;&#xFF0C;&#x5728;&#x793E;&#x533A;&#x6709;&#x5F88;&#x591A;&#x79EF;&#x6781;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
</blockquote>
<iframe width="620" height="349" src="https://www.youtube.com/embed/GhRE3rML9t4" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>

<p>Houdini-CSS&#x7684;&#x672A;&#x6765;&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x5230;&#x6765;&#xFF01;&#x8BE5;&#x89C4;&#x8303;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;JavaScript&#x8BED;&#x6CD5;&#x7F16;&#x5199;Web worklet&#xFF0C;&#x5E76;&#x9996;&#x6B21;&#x8BBF;&#x95EE;CSS&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x3002;&#x4E00;&#x5207;&#x90FD;&#x4F1A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x7684;&#xFF01;</p>
<p>&#x5728;&#x672C;&#x6B21;&#x6F14;&#x8BB2;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x901A;&#x8FC7;&#x4F7F;&#x7528;<a href="https://developers.google.com/web/updates/2016/05/houdini" target="_blank">Houdini</a>&#x53CA;&#x5176;&#x5404;&#x79CD;&#x5373;&#x5C06;&#x63A8;&#x51FA;&#x7684;&#x6D4F;&#x89C8;&#x5668;API&#x6765;&#x521B;&#x5EFA;&#x7684;&#x4E00;&#x4E9B;&#x89C6;&#x89C9;&#x6548;&#x679C;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x73B0;&#x573A;&#x6F14;&#x793A;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x5B9E;&#x8DF5;&#x3002;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;Houdini&#x4EE5;&#x53CA;&#x5B83;&#x5BF9;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6837;&#x5F0F;&#x7684;&#x672A;&#x6765;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1.png" alt=""></p>
<h3 id="&#x6B63;&#x7A3F;">&#x6B63;&#x7A3F;</h3>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/1.jpg" alt=""></p>
<p>&#x5927;&#x5BB6;&#x597D;&#x3002;&#x6211;&#x5F88;&#x9AD8;&#x5174;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#x3002;&#x8C08;&#x5230;Houdini&#xFF0C;&#x6709;&#x592A;&#x591A;&#x7684;&#x6211;&#x60F3;&#x7ED9;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8BA9;&#x6211;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x60F3;&#x7ACB;&#x9A6C;&#x5C31;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x662F;&#x6709;&#x539F;&#x56E0;&#x7684;&#x3002;&#x5F53;&#x6211;&#x8FD8;&#x662F;&#x4E2A;&#x5C0F;&#x5B69;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x72D7;&#xFF0C;&#x5B83;&#x751F;&#x75C5;&#x4E86;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/3.jpg" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x50CF;15&#x5E74;&#x524D;&#x5199;&#x7684;CSS&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x65F6;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4ECA;&#x5929;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x6709;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x624B;&#x5934;&#x4E0A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4F7F;&#x7F16;&#x5199;Web&#x6837;&#x5F0F;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6109;&#x5FEB;&#x3002;CSS&#x4ECD;&#x7136;&#x6709;&#x5B83;&#x7684;&#x5931;&#x8D25;&#x4E4B;&#x5904;&#x548C;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x8BA9;&#x6211;&#x4EEC;&#x8C08;&#x8C08;&#x8868;&#x5355;&#x6837;&#x5F0F;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5728;2019&#x5E74;&#x8BBE;&#x7F6E;&#x8868;&#x683C;&#x6837;&#x5F0F;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x719F;&#x6089;<a href="https://www.w3schools.com" target="_blank">W3School</a>&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6559;&#x80B2;&#x7F51;&#x7AD9;&#xFF0C;&#x5B83;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x4E86;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x7F51;&#x9875;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x770B;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E0B;&#x62C9;&#x5217;&#x8868;&#xFF0C;&#x6211;&#x60F3;&#xFF0C;&#x201C;&#x54E6;&#xFF0C;&#x9177;&#x3002;&#x201D;&#x6211;&#x4EEC;&#x6240;&#x8981;&#x505A;&#x7684;&#x6B65;&#x9AA4;&#x662F;&#x62E5;&#x6709;HTML&#xFF0C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;CSS-&#x5F88;&#x597D;-&#x90A3;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x5BA4;&#x5143;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#xFF0C;&#x8FD9;&#x662F;[&#x58F0;&#x97F3;&#x95EE;&#x9898;]&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/2.jpg" alt=""></p>
<p>&#x76F4;&#x5230;&#x4ECA;&#x5929;&#xFF0C;&#x8FD9;&#x4F9D;&#x7136;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x559C;&#x6B22;&#x628A;&#x903B;&#x8F91;&#x548C;&#x6837;&#x5F0F;&#x5206;&#x5F00;&#x3002;&#x4F60;&#x65E0;&#x6CD5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x505A;&#x5230;&#x52A8;&#x6001;&#x6E10;&#x53D8;&#xFF0C;&#x5B83;&#x4EEC;&#x5F88;&#x9177;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x503C;&#x5217;&#x8868;-&#x5B9E;&#x65F6;&#x663E;&#x793A;&#x5728;&#x9875;&#x9762;&#x4E0A;-&#x4F60;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x5C42;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/5.jpg" alt=""></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x56FE;&#x50CF;&#x4E0A;&#x521B;&#x5EFA;&#x6EE4;&#x955C;&#x6548;&#x679C;&#x65F6;&#xFF0C;&#x5B83;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x6CA1;&#x770B;&#x4E0D;&#x61C2;...</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/6.jpg" alt=""></p>
<p>&#x6E10;&#x53D8;&#x5462;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x7ED5;&#x4E2D;&#x5FC3;&#x65CB;&#x8F6C;&#x5E76;&#x5230;&#x8FBE;&#x8BE5;&#x70B9;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x521B;&#x5EFA;...&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x6E10;&#x53D8;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x503C;&#x521B;&#x5EFA;&#x989C;&#x8272;&#xFF0C;&#x5E76;&#x5728;&#x4E2D;&#x95F4;&#x521B;&#x5EFA;&#x989C;&#x8272;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/7.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x67E5;&#x770B;&#x201C;&#x6211;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x6E10;&#x53D8;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x5730;&#x88AB;&#x5B58;&#x50A8;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x6E10;&#x53D8;&#x662F;CSS&#x4E2D;&#x76EE;&#x524D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;div&#xFF0C;&#x5F53;&#x6211;&#x9F20;&#x6807;hover&#x4E0A;&#x53BB;&#x65F6;&#xFF0C;div&#x4ECE;&#x7EA2;&#x8272;&#x8F6C;&#x6362;&#x6210;&#x84DD;&#x8272;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/8.jpg" alt=""></p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x8981;&#x5728;&#x6B64;&#x6E10;&#x53D8;&#x5185;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x6211;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x4ECE;&#x7EA2;&#x8272;&#x5230;&#x84DD;&#x8272;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x5230;&#x6DF1;&#x7C89;&#x7EA2;&#x8272;&#x3002;&#x5F53;&#x6211;&#x5C06;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x5728;&#x6B64;&#xFF08;div&#xFF09;&#x7684;&#x6E10;&#x53D8;&#x533A;&#x57DF;&#x4E0A;&#x65F6;&#xFF0C;&#x5B83;&#x65E0;&#x6CD5;&#x8F6C;&#x6362;&#x8BE5;&#x503C;&#xFF0C;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5B83;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x65E0;&#x6CD5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/9.jpg" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x81EA;&#x5B9A;&#x4E49;&#x8FB9;&#x6846;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x68D2;&#x7684;&#x8FB9;&#x754C;&#x6570;&#x503C;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x5F88;&#x9177;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x5F88;&#x6709;&#x9650;&#x7684;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/10.jpg" alt=""></p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/11.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x505A;&#x4E00;&#x4E9B;&#x50CF;&#x62D0;&#x89D2;&#x5F62;&#x72B6;&#x8FD9;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x906E;&#x76D6;&#x56FE;&#x50CF;&#x5E76;&#x5728;&#x8BE5;&#x5143;&#x7D20;&#x4E0A;&#x5E94;&#x7528;&#x8FB9;&#x6846;&#x5F62;&#x72B6;&#xFF0C;&#x90A3;&#x8FD9;&#x4E0D;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#xFF0C;&#x8FD9;&#x662F;200013&#x89C4;&#x8303;&#xFF0C;&#x5B83;&#x8BD5;&#x56FE;&#x5C06;&#x5176;&#x63A8;&#x8FDB;&#xFF0C;&#x4F46;&#x4ECE;&#x672A;&#x771F;&#x6B63;&#x8FDB;&#x5165;&#x6D4F;&#x89C8;&#x5668;-&#x633A;&#x96BE;&#x8FC7;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6709;Houdini&#x5417;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x542C;&#x8BF4;&#x8FC7;Houdini&#xFF0C;&#x90A3;&#x5C31;&#x771F;&#x7684;&#x975E;&#x5E38;&#x9057;&#x61BE;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x5B83;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x4E3A;CSS&#x63D0;&#x4F9B;&#x7684;&#x57FA;&#x672C;API&#xFF0C;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x8BBF;&#x95EE;CSS&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x7684;API&#xFF0C;&#x5B83;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x544A;&#x8BC9;&#x6D4F;&#x89C8;&#x5668;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5B83;&#x5982;&#x4F55;&#x8BFB;&#x53D6;CSS&#x4EE3;&#x7801;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x4E2A;&#x73B0;&#x5728;&#x5C31;&#x80FD;&#x505A;&#x5230;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x8981;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6837;&#x5F0F;&#x76EE;&#x524D;&#x5C1A;&#x4E0D;&#x53EF;&#x7528;CSS&#x5C5E;&#x6027;&#x548C;&#x503C;&#x5BF9;&#x6765;&#x7F16;&#x5199;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;CSS&#x7F16;&#x5199;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x5FC5;&#x987B;&#x4E3A;&#x5176;&#x7F16;&#x5199;JavaScript polyfill&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5C06;&#x904D;&#x5386;&#x6B64;&#x89E3;&#x6790;&#x5668;&#x96C6;&#x5E76;&#x8BFB;&#x53D6;DOM&#x548C;CSS&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x7528;JavaScript polyfill&#x518D;&#x6B21;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x8981;&#x5728;&#x5DF2;&#x52A0;&#x8F7D;&#x6837;&#x5F0F;&#x540E;&#x5C06;&#x6837;&#x5F0F;&#x91CD;&#x65B0;&#x5E94;&#x7528;&#x4E8E;&#x9875;&#x9762;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/12.jpg" alt=""></p>
<p>&#x4F46;&#x662F;&#x4F7F;&#x7528;Houdini&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6837;&#x5F0F;&#x76F4;&#x63A5;&#x5E94;&#x7528;&#x4E8E;CSS&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x548C;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x6837;&#x62E5;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;CSS&#x6B65;&#x9AA4;&#x4E2D;&#x544A;&#x8BC9;&#x6D4F;&#x89C8;&#x5668;&#x5B83;&#x5728;&#x8BFB;&#x53D6;&#x4EE3;&#x7801;&#x65F6;&#x5E94;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x771F;&#x662F;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x3002;&#x867D;&#x7136;&#x89C4;&#x8303;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x6D4F;&#x89C8;&#x5668;&#x4E00;&#x76F4;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#x4EFB;&#x4F55;&#x6211;&#x4EEC;&#x60F3;&#x5B9E;&#x73B0;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/13.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x76EE;&#x524D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x5080;&#x5121;&#x4E00;&#x6837;&#xFF0C;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#xFF0C;CSS&#x586B;&#x5145;&#xFF0C;&#x521B;&#x5EFA;JavaScript&#x6765;&#x5B8C;&#x6210;&#x5B83;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x5B58;&#x5728;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x3002;&#x633A;&#x9177;&#x7684;&#x3002;&#x73B0;&#x5728;&#x6700;&#x597D;&#x7684;&#x8D44;&#x6E90;&#x662F;Houdini&#xFF0C;&#x5B83;&#x51C6;&#x5907;&#x597D;&#x4E86;-&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x540C;&#x610F;&#x5B9E;&#x73B0;&#x89C4;&#x8303;&#xFF0C;&#x4EE5;&#x53CA;W3&#x89C4;&#x8303;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x4E86;<a href="http://ishoudinireadyyet.com/" target="_blank">Houdini</a>&#x53BB;&#x9605;&#x8BFB;&#x3002;&#x201C;&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x5417;&#xFF1F;&#x201D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x5F53;&#x524D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;CSS polyfill&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x6A21;&#x578B;&#xFF0C;&#x521B;&#x5EFA;&#x8981;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x7684;JavaScript&#x6765;&#x50CF;&#x8FD9;&#x79CD;&#x5C0F;&#x7F29;&#x653E;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x5B58;&#x5728;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x3002;&#x76EE;&#x524D;&#x6700;&#x597D;&#x7684;&#x8D44;&#x6E90;&#x662F;Houdini&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x5C31;&#x7EEA;-&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x540C;&#x610F;&#x5B9E;&#x73B0;&#x89C4;&#x8303;&#xFF0C;&#x4EE5;&#x53CA;W3&#x89C4;&#x8303;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x4E86;<a href="http://ishoudinireadyyet.com/" target="_blank">Houdini</a>&#x53BB;&#x9605;&#x8BFB;&#x6587;&#x6863;&#x3002;&#x6587;&#x6863;&#x4E0A;&#x6709;&#x201C;&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x5417;&#xFF1F;&#x201D;&#x72B6;&#x6001;&#x8868;&#x793A;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x4E00;&#x9879;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6700;&#x53D7;&#x652F;&#x6301;&#x7684;API&#x662F;Paint API&#x548C;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x9650;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x8981;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/14.jpg" alt=""></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x5F00;&#x59CB;&#x3002;&#x7C7B;&#x578B;&#x5316;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x66F4;&#x591A;&#x7684;CSS&#x8BED;&#x4E49;&#x89E3;&#x6790;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;&#x73B0;&#x5728;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x57FA;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6B63;&#x5219;&#x89E3;&#x6790;&#xFF0C;&#x8FD9;&#x5F88;&#x6162;&#xFF0C;&#x5B83;&#x6B63;&#x5728;&#x5BFB;&#x627E;ID&#xFF0C;&#x5C5E;&#x6027;&#xFF0C;&#x7C7B;&#x6216;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x5173;&#x952E;&#x5B57;&#xFF08;&#x4F8B;&#x5982;&#x6B64;&#x5904;&#x7684;&#x70B9;&#xFF09;&#x548C;&#x76F4;&#x5230;&#x6253;&#x5F00;&#x5927;&#x62EC;&#x53F7;&#x4E3A;&#x6B62;&#xFF0C;&#x7136;&#x540E;&#x67E5;&#x627E;&#x5C5E;&#x6027;&#x503C;&#xFF0C;&#x5192;&#x53F7;&#xFF0C;&#x503C;&#xFF0C;&#x5355;&#x4F4D;&#xFF0C;&#x5206;&#x53F7;&#xFF0C;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x503C;&#x662F;&#x6B63;&#x786E;&#x7684;&#x503C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x4F1A;&#x5F88;&#x5FEB;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6DF7;&#x4E71;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x62E5;&#x6709;&#x4E00;&#x4E9B;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x8981;&#x6162;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x6B64;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x8BE5;&#x7ED3;&#x6784;&#x5316;&#x6A21;&#x578B;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/15.jpg" alt=""></p>
<p>&#x6211;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;height&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;CSS&#x5355;&#x4F4D;&#x503C;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x8FD4;&#x56DE;&#x503C;&#x548C;&#x5355;&#x4F4D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5177;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x4F7F;&#x8BFB;&#x53D6;CSS&#x7684;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x6B63;&#x5728;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x76D2;&#x5B50;&#xFF0C;&#x5B83;&#x6709;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8BA1;&#x7B97;&#x673A;&#x6837;&#x5F0F;&#x4E2D;&#x83B7;&#x53D6;&#x5C5E;&#x6027;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5C5E;&#x6027;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;css.number&#x5E76;&#x4E3A;&#x5176;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6267;&#x884C;&#x8BE5;&#x64CD;&#x4F5C;&#x65F6;&#x518D;&#x6B21;&#x66F4;&#x65B0;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5B83;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/16.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x5728;DevTools&#x4E2D;&#x67E5;&#x770B;&#x6B64;&#x5185;&#x5BB9;&#xFF0C;&#x5C06;&#x83B7;&#x5F97;CSS&#x5355;&#x4F4D;&#x503C;&#x5BF9;&#x8C61;&#xFF0C;&#x628A;&#x8BE5;&#x5355;&#x4F4D;&#x548C;&#x503C;&#x88AB;&#x5206;&#x79BB;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x5C31;&#x5F15;&#x51FA;&#x4E86;&#x5C5E;&#x6027;&#x548C;&#x503C;&#x7684;API&#x3002;&#x4F60;&#x4EEC;&#x73B0;&#x5728;&#x6709;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x8FC7;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF1F;&#x5927;&#x6982;&#x6709;30&#xFF05;&#x7528;&#x8FC7;&#x3002;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x786E;&#x5B9E;&#x5F88;&#x68D2;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x6211;&#x4EEC;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x5B9E;&#x9645;&#x7684;&#x52A8;&#x6001;CSS&#x53D8;&#x91CF;&#x3002;&#x4E0E;Sass&#x4E0D;&#x540C;&#xFF0C;&#x5728;Sass&#x4E2D;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x5C06;&#x88AB;&#x79FB;&#x690D;&#x7ED9;&#x67D0;&#x4E2A;&#x503C;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x5728;JavaScript&#x4E2D;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/17.jpg" alt=""></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x5C06;&#x903B;&#x8F91;&#x548C;&#x6837;&#x5F0F;&#x5206;&#x5F00;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6837;&#x5F0F;&#x90E8;&#x5206;&#x4FDD;&#x7559;&#x5728;CSS&#x4E2D;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x903B;&#x8F91;&#x66F4;&#x6539;&#x6765;&#x8FBE;&#x5230;&#x5728;JavaScript&#x5185;&#x90E8;&#x66F4;&#x6539;&#x8BE5;&#x503C;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x7ED9;&#x5B83;&#xFF0C;&#x800C;&#x4E14;&#x8D85;&#x7EA7;&#x52A8;&#x6001;&#xFF0C;&#x8D85;&#x9177;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4F60;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x503C;&#x6765;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x5C5E;&#x6027;&#x548C;&#x503C;&#x7684;API&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x83B7;&#x53D6;&#x5230;&#x3002;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x4E3A;&#x5176;&#x6307;&#x5B9A;&#x5C5E;&#x6027;&#x540D;&#xFF0C;&#x4ED6;&#x7684;&#x8BED;&#x6CD5;&#x548C;&#x521D;&#x59CB;&#x503C;&#x5B9A;&#x4E49;&#xFF0C;&#x4EE5;&#x53CA;&#xFF08;&#x5982;&#x679C;&#x5B83;&#x4E0D;&#x4F1A;&#x4ECE;&#x5176;&#x7236;&#x9879;&#x7EE7;&#x627F;&#x7684;&#x8BDD;&#xFF09;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x770B;&#x4E00;&#x4E0B;&#x6E10;&#x53D8;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x76D2;&#x5B50;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x989C;&#x8272;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x662F;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x6B63;&#x5728;&#x4ECE;&#x8BE5;&#x989C;&#x8272;&#x8FC7;&#x6E21;&#x3002;&#x6211;&#x6307;&#x5B9A;&#x7684;&#x8FC7;&#x6E21;&#x65F6;&#x95F4;&#x5C06;&#x662F;&#x4E00;&#x79D2;&#x949F;&#xFF0C;&#x60AC;&#x505C;&#x65F6;&#x5B83;&#x5C06;&#x53D8;&#x6210;&#x84DD;&#x8272;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/18.jpg" alt=""></p>
<p>&#x6211;&#x6709;&#x989C;&#x8272;&#x505C;&#x6B62;&#xFF0C;&#x8BED;&#x6CD5;&#x662F;&#x989C;&#x8272;&#xFF0C;&#x5E76;&#x6307;&#x5B9A;&#x8BE5;&#x8BED;&#x6CD5;&#x3002;&#x6211;&#x4E0D;&#x4F1A;&#x7EE7;&#x627F;&#x900F;&#x660E;&#x7684;&#x521D;&#x59CB;&#x503C;&#x3002;&#x5F53;&#x6211;&#x5C06;&#x5176;&#x66F4;&#x65B0;&#x4E3A;&#x4E0D;&#x892A;&#x8272;&#xFF0C;&#x5728;&#x6B64;&#x66F4;&#x65B0;&#x6B64;&#x503C;&#x4EE5;&#x53CA;&#x4E0D;&#x892A;&#x8272;&#x65F6;&#xFF0C;&#x4E5F;&#x5C06;&#x66F4;&#x65B0;&#x4E3A;&#x8FC7;&#x6E21;&#x5230;&#x4E0D;&#x892A;&#x8272;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x521B;&#x5EFA;&#x4E86;&#x60AC;&#x505C;&#x4EE5;&#x5339;&#x914D;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#xFF0C;&#x5B83;&#x5C06;&#x6162;&#x6162;&#x6D88;&#x5931;&#x53D8;&#x6210;&#x4E86;&#x84DD;&#x8272;&#x3002;[&#x638C;&#x58F0;]&#x3002;</p>
<p>&#x6211;&#x559C;&#x6B22;&#x89C6;&#x89C9;&#x6F14;&#x793A;&#xFF01;&#x5C31;&#x50CF;&#xFF0C;&#x54C7;&#x3002;&#x6211;&#x8F93;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x540D;&#xFF0C;&#x6CE8;&#x518C;&#x5C5E;&#x6027;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5;&#x5728;&#x540E;&#x9762;&#x7684;&#x5C5E;&#x6027;&#x5B8C;&#x6210;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/19.jpg" alt=""></p>
<p>&#x8FD9;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;&#x5BF9;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x7406;&#x89E3;&#x8FD9;&#x4E24;&#x4E2A;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x63D2;&#x503C;&#x662F;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x7684;&#x3002;&#x5173;&#x4E8E;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x521D;&#x59CB;&#x7684;&#x540E;&#x5907;&#x503C;&#x3002;&#x6211;&#x8981;&#x6CE8;&#x518C;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x521D;&#x7EA7;&#x989C;&#x8272;&#x548C;&#x4E8C;&#x7EA7;&#x989C;&#x8272;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x770B;&#x4E00;&#x4E0B;CSS&#xFF0C;&#x60AC;&#x505C;&#x65F6;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x539F;&#x8272;&#x8FC7;&#x6E21;&#x5230;&#x526F;&#x8272;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x83B7;&#x5F97;&#x4E00;&#x79D2;&#x949F;&#x7684;&#x8FC7;&#x6E21;&#x65F6;&#x95F4;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x5728;CSS&#x5185;&#x6307;&#x5B9A;&#x8BE5;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x8BE5;&#x53D8;&#x91CF;&#x3002;&#x6211;&#x4E0D;&#x5FC5;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5DF2;&#x7ECF;&#x5728;CSS&#x5DF2;&#x6CE8;&#x518C;&#x5C5E;&#x6027;&#x4E2D;&#x6CE8;&#x518C;&#x4E86;&#x5B83;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/20.jpg" alt=""></p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x539F;&#x8272;&#x3002;&#x6211;&#x53EF;&#x4EE5;&#x5C06;&#x539F;&#x8272;&#x6D82;&#x6210;&#x7EA2;&#x8272;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x5C06;&#x66F4;&#x65B0;&#x4E3A;&#x7EA2;&#x8272;&#x3002;&#x90A3;&#x91CC;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x968F;&#x65F6;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x5B83;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/21.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x6211;&#x4E0D;&#x5C0F;&#x5FC3;&#xFF0C;&#x8F93;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x50CF;23&#x8FD9;&#x6837;&#x7684;&#x5047;&#x503C;&#xFF0C;&#x5B83;&#x5C06;&#x603B;&#x662F;&#x9000;&#x56DE;&#x5230;&#x84DD;&#x7D2B;&#x8272;&#x3002;&#x8BA9;&#x6211;&#x5411;&#x4F60;&#x5C55;&#x793A;&#x5982;&#x679C;&#x6211;&#x4E0D;&#x6CE8;&#x518C;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x80CC;&#x666F;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x65E0;&#x6548;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x6211;&#x8FD0;&#x884C;&#x6B64;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4F1A;&#x53D8;&#x56DE;&#x900F;&#x660E;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/22.jpg" alt=""></p>
<p>CSS&#x6700;&#x597D;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x7684;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x5FFD;&#x7565;&#x9519;&#x8BEF;&#x7684;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x4F60;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x671F;&#x5F85;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x7A7A;&#x901A;&#x9053;&#x548C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;CSS&#x3002;&#x5C31;&#x50CF;&#x8F93;&#x5165;CSS&#x53D8;&#x91CF;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x5BF9;CSS&#x7CFB;&#x7EDF;&#x3001;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x786E;&#x4FDD;&#x5728;&#x4F7F;&#x7528;CSS&#x6784;&#x5EFA;Web&#x65F6;&#x4E0E;&#x56E2;&#x961F;&#x4FDD;&#x6301;&#x4E00;&#x5207;&#x8D85;&#x7EA7;&#x51DD;&#x805A;&#x529B;&#xFF0C;&#x5E76;&#x4F7F;&#x5B83;&#x4EEC;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x60F3;&#x8C08;&#x8C08;Paint worklet&#x3002;&#x5982;&#x679C;&#x4F60;&#x542C;&#x8BF4;&#x8FC7;&#x670D;&#x52A1;&#x4EBA;&#x5458;&#x548C;&#x7F51;&#x7EDC;&#x4EBA;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x5C42;-&#x5B83;&#x9884;&#x5148;&#x5448;&#x73B0;&#x8D44;&#x6E90;&#x548C;&#x63A8;&#x9001;&#x901A;&#x77E5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F4D;&#x4E8E;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/23.jpg" alt=""></p>
<p>&#x5F53;&#x4F60;&#x6253;&#x5F00;&#x7F51;&#x7AD9;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;worklet&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5373;&#x4F7F;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x5904;&#x4E8E;&#x8131;&#x673A;&#x72B6;&#x6001;&#x4E5F;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x8BBF;&#x95EE;&#x5B83;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x6CE8;&#x518C;worklet&#xFF0C;&#x4F7F;&#x7528;Paint worklet&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5728;JavaScript&#x4E2D;&#x6240;&#x505A;&#x7684;&#x5C31;&#x662F;&#x6CE8;&#x518C;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x7ED9;&#x5B83;&#x8D77;&#x4E2A;&#x540D;&#x5B57;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/25.jpg" alt=""></p>
<p>&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x8BFE;&#x7A0B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x653E;&#x5728;&#x90A3;&#x91CC;&#x3002;&#x5728;HTML&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;...&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;&#x547D;&#x540D;&#x6CE8;&#x518C;&#x6240;&#x7ED8;&#x5236;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x518D;&#x8C03;&#x7528;CSS&#xFF0C;&#x7136;&#x540E;&#x6309;&#x540D;&#x79F0;&#x6307;&#x5B9A;&#x8BE5;&#x5DE5;&#x4F5C;&#x526A;&#x8F91;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6B64;&#x793A;&#x4F8B;&#x4E2D;&#x5C06;&#x5176;&#x547D;&#x540D;&#x4E3A;<code>fun</code>,&#x8FD9;&#x6837;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x80CC;&#x666F;&#x7ED8;&#x5236;&#x4E86;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/26.jpg" alt=""></p>
<p>&#x8FD9;&#x662F;JavaScript&#x548C;CSS&#x5417;&#xFF1F;&#x662F;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x6211;&#x5236;&#x4F5C;&#x7684;&#x8FD9;&#x4E2A;&#x5C0F;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/27.jpg" alt=""></p>
<p>&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x6587;&#x5B57;&#xFF0C;&#x6211;&#x6B63;&#x5728;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x5199;&#x4E86;&#x8FD9;&#x4E2A;&#x5C0F;&#x5F69;&#x8679;worklet&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x6211;&#x4ECE;&#x5DE6;&#x4E0A;&#x5230;&#x53F3;&#x4E0B;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x50CF;&#x7D20;&#x503C;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#x3002;&#x7136;&#x540E;&#x5728;HTML&#x4E2D;&#xFF0C;&#x6211;&#x5C06;worklet&#x6DFB;&#x52A0;&#x5230;CSS&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6837;&#x5F0F;&#x6DFB;&#x52A0;&#x5230;&#x6837;&#x5F0F;&#x4E2D;&#xFF08;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x80CC;&#x666F;&#x56FE;&#x7247;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x8FB9;&#x6846;&#x56FE;&#x50CF;&#xFF0C;&#x4EE5;&#x4EFB;&#x4F55;&#x9700;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;CSS&#x4E2D;&#x83B7;&#x5F97;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6548;&#x679C;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/28.jpg" alt=""></p>
<p>&#x5C06;&#x8FD9;&#x4E9B;&#x5173;&#x6CE8;&#x70B9;&#x5206;&#x5F00;&#x3002;&#x8FD9;&#x53C8;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x9525;&#x68AF;&#x5EA6;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;Polly&#x6587;&#x4EF6;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/29.jpg" alt=""></p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;polyfill&#x3002;&#x8BE5;polyfill&#x7528;&#x6765;&#x7F16;&#x5199;&#x6B64;worklet&#x4EE5;&#x5141;&#x8BB8;&#x6E10;&#x53D8;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x4E0A;&#x4E0B;&#x6587;&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x3001;&#x5C5E;&#x6027;&#x548C;&#x53C2;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53D1;&#x9001;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;CSS&#x7C7B;&#x578B;&#x4E2D;&#x8F93;&#x5165;<code>red</code>&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x68AF;&#x5EA6;&#x68AF;&#x5EA6;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x5706;&#x4E86;&#x3002;&#x8FD9;&#x5F88;&#x9177;&#x3002;&#x7279;&#x5F81;&#x8BED;&#x6CD5;&#x5C06;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5728;&#x53D8;&#x91CF;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x80CC;&#x666F;&#x6E10;&#x53D8;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x8BED;&#x6CD5;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/30.jpg" alt=""></p>
<p>&#x540C;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x5728;&#x6269;&#x5C55;&#x6269;&#x5C55;Web&#x7684;&#x8FB9;&#x754C;&#x3002;&#x592A;&#x9177;&#x4E86;&#x3002;&#x6211;&#x73B0;&#x5728;&#x4ECE;&#x4E8B;&#x7D20;&#x6750;&#x8BBE;&#x8BA1;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/31.jpg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x6765;&#x521B;&#x5EFA;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5B9A;&#x5236;&#x4E3B;&#x9898;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x989C;&#x8272;&#x3001;&#x4E3B;&#x9898;&#x548C;&#x5F62;&#x72B6;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x53EB;&#x505A;Shine&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5176;&#x4E2D;&#x5177;&#x6709;&#x8FD9;&#x79CD;&#x6709;&#x89D2;&#x5EA6;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x62E5;&#x6709;&#x7684;&#x4E24;&#x79CD;&#x5F62;&#x72B6;&#x89C4;&#x8303;&#xFF0C;&#x5706;&#x89D2;&#x662F;&#x4E00;&#x79CD;&#xFF0C;&#x4F60;&#x7EDD;&#x5BF9;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x6211;&#x4EEC;&#x8FD8;&#x4E0D;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4E4B;&#x524D;&#x6240;&#x5C55;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x89D2;&#x843D;&#x5F62;&#x72B6;&#x89C4;&#x8303;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x5730;&#x88AB;&#x843D;&#x5B9E;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;CSS Houdini&#x7684;Paint worklet&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x505A;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x6307;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x534A;&#x5F84;&#xFF0C;Paint&#x98CE;&#x683C;&#x88AB;&#x8986;&#x76D6;&#xFF0C;&#x6216;&#x586B;&#x5145;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x73A9;&#xFF0C;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7684;&#x611F;&#x89C9;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x88C5;&#x9970;&#x6216;&#x8005;&#x5904;&#x7406;&#x80CC;&#x666F;&#x3002;&#x8BB0;&#x5F97;&#x6211;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x5904;&#x7406;&#x663E;&#x793A;&#x80CC;&#x666F;&#x7684;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/32.jpg" alt=""></p>
<p>&#x5F53;&#x4F60;&#x4F7F;&#x7528;WebKit&#x8499;&#x7248;&#x56FE;&#x50CF;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x6307;&#x5B9A;&#x8981;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x540E;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x6765;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x6750;&#x8D28;&#x6309;&#x94AE;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x51F9;&#x69FD;&#x3002;&#x8FD9;&#x662F;&#x6700;&#x521D;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5F53;&#x4F60;&#x5C06;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x5728;&#x6B64;&#x5904;&#x65F6;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x5927;&#x6311;&#x6218;&#x662F;&#x5305;&#x542B;&#x6D9F;&#x6F2A;&#x6548;&#x5E94;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x6211;&#x5728;&#x7F3A;&#x53E3;&#x89D2;&#x5DE5;&#x4F5C;&#x533A;&#x4E2D;&#x521B;&#x5EFA;&#x5E76;&#x5C06;&#x5176;&#x5728;CSS&#x4E2D;&#x5E94;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x6982;&#x8FF0;&#x7684;&#x6309;&#x94AE;&#x548C;&#x586B;&#x5145;&#x7684;&#x6309;&#x94AE;&#x65F6;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x4E86;&#x80CC;&#x666F;&#x548C;&#x8499;&#x7248;&#x7684;&#x6DF7;&#x5408;&#x4F53;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x5E76;&#x9010;&#x6B65;&#x589E;&#x5F3A;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x652F;&#x6301;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x80CC;&#x666F;&#xFF0C;&#x5B83;&#x5C06;&#x4EC5;&#x9000;&#x56DE;&#x5230;CSS&#x7684;&#x524D;&#x4E00;&#x884C;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x96C6;&#x6210;&#x5230;&#x6211;&#x4EEC;&#x7684;UI&#x4E2D;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6765;&#x70B9;&#x9B54;&#x6CD5;&#x5427;&#x3002;&#x6211;&#x8981;&#x5728;&#x8FD9;&#x91CC;&#x505A;&#x4E00;&#x4E2A;&#x73B0;&#x573A;&#x6F14;&#x793A;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/33.jpg" alt=""></p>
<p>&#x795D;&#x6211;&#x597D;&#x8FD0;&#x3002;&#x8B66;&#x544A;&#xFF1A;&#x8FD9;&#x662F;&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x542F;&#x7528;&#x4E86;Web&#x5E73;&#x53F0;&#x529F;&#x80FD;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4F7F;&#x7528;ACDVS&#x6216;localhost&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F4D;&#x4E8E;&#x9875;&#x9762;&#x4E4B;&#x5916;&#xFF0C;&#x5E76;&#x4E14;&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x80FD;&#x884C;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x753B;&#x5E03;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x8FD9;&#x91CC;&#x51C6;&#x5907;&#x4E86;&#x4E00;&#x5F20;&#x753B;&#x5E03;&#xFF0C;&#x53EA;&#x662F;&#x7ED9;&#x4E86;&#x5B83;&#x4E00;&#x4E2A;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#x3002;&#x6211;&#x8981;&#x653E;&#x5927;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x80FD;&#x770B;&#x5F97;&#x66F4;&#x6E05;&#x695A;&#x4E00;&#x4E9B;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/35.jpg" alt=""></p>
<p>&#x5728;&#x6211;&#x7684;JavaScript&#x4E2D;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x51FD;&#x6570;&#xFF0C;&#x8BBE;&#x7F6E;&#x753B;&#x5E03;&#xFF0C;&#x63D0;&#x4F9B;&#x95EA;&#x70C1;&#x3001;&#x9AD8;&#x5EA6;&#x3001;&#x91CD;&#x91CF;&#x5BBD;&#x5EA6;&#x548C;&#x4F4D;&#x7F6E;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5B83;&#x9AD8;&#x5EA6;&#x3001;&#x5BBD;&#x5EA6;&#x548C;&#x91CD;&#x91CF;&#x968F;&#x673A;&#xFF0C;&#x628A;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x4E5F;&#x968F;&#x673A;&#x5316;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/34.jpg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x989C;&#x8272;&#x8BBE;&#x5B9A;&#x597D;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x628A;&#x8FD9;&#x4E2A;&#x753B;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6BCF;&#x6B21;&#x6211;&#x5237;&#x65B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x706B;&#x82B1;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x706B;&#x82B1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x706B;&#x82B1;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x8BBE;30&#x4E2A;&#x706B;&#x82B1;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x6765;&#x5FAA;&#x73AF;&#x5E76;&#x5E94;&#x7528;&#x706B;&#x82B1;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/36.jpg" alt=""></p>
<p>&#x4E00;&#x65E6;&#x91CD;&#x65B0;&#x4FBF;&#x5DF2;&#x5B8C;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x4E86;&#x6240;&#x6709;&#x7684;30&#x4E2A;&#x706B;&#x82B1;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x989C;&#x8272;&#x7684;&#x9EC4;&#x8272;&#x6709;&#x70B9;&#x592A;&#x76F8;&#x8FD1;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;HSL&#x503C;&#x6765;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x9971;&#x548C;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x4ECB;&#x4E8E;90&#x5230;100&#x4E4B;&#x95F4;&#x3002;&#x8272;&#x8C03;&#x5C06;&#x662F;&#x9EC4;&#x8272;/&#x6A59;&#x8272;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x5149;&#x662F;&#x53D8;&#x5316;&#x6700;&#x5927;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x53EF;&#x4EE5;&#x53BB;&#x6389;&#x989C;&#x8272;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x4E2A;&#x753B;&#x5E03;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x73B0;&#x5728;&#x60F3;&#x628A;&#x5B83;&#x53D8;&#x6210;&#x4E00;&#x4E2A;Paint worklet&#xFF0C;&#x5BF9;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E9B;&#x90FD;&#x5904;&#x7406;&#x6389;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x90FD;&#x719F;&#x6089;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x662F;....&#x8FD9;&#x662F;&#x5C55;&#x793A;X&#x7684;Codepen&#x5417;&#xFF1F;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x5417;&#xFF1F;&#x8FD9;&#x91CC;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x662F;&#x7A7A;&#x683C;&#x4FDD;&#x6301;&#x5B83;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x3002;&#x6211;&#x4F1A;&#x8BA9;&#x4F60;&#x770B;&#x770B;&#x8FD9;&#x91CC;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x3002;&#x5982;&#x679C;&#x6211;&#x4E00;&#x76F4;&#x7F29;&#x5C0F;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x662F;X&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8BD5;&#x7740;&#x5728;&#x8FD9;&#x4E2A;X&#x4E0A;&#x505A;&#x4E00;&#x4E2A;Houdini&#x7684;&#x9B54;&#x672F;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x81EA;&#x4ECE;BBC&#x53BB;&#x6389;&#x4E86;HTML&#x4E2D;&#x7684;&#x753B;&#x5E03;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x6446;&#x8131;JavaScript&#x4E2D;&#x7684;&#x753B;&#x5E03;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x4E00;&#x4E2A;Worklet&#x3002;&#x6211;&#x4EEC;&#x5C31;&#x5148;&#x8FD9;&#x4E48;&#x505A;&#x5427;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/37.jpg" alt=""></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7C7B;&#x578B;&#x7684;&#x6CE8;&#x518C;Paint&#x662F;&#x5426;&#x4E0D;&#x7B49;&#x4E8E;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>sparkle</code>&#x7684;&#x7C7B;&#x3002;&#x7136;&#x540E;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x7528;Paint&#xFF0C;&#x5C06;&#x5F97;&#x5230;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5E94;&#x7528;&#x7684;div&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x5927;&#x5C0F;&#x3002;&#x3002;&#x4ECE;&#x8FD9;&#x91CC;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5C06;&#x5176;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x90FD;&#x505A;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x9020;&#x4E86;&#x8FD9;&#x4E9B;&#x706B;&#x82B1;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x653E;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x73B0;&#x5728;&#x6211;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5148;&#x6CE8;&#x518C;&#x5B83;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x58F0;&#x660E;&#x4E4B;&#x5916;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#xFF0C;&#x4EE5;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x751A;&#x81F3;&#x652F;&#x6301;&#x8BE5;&#x58F0;&#x660E;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5957;&#x51C6;&#x7ED8;&#x5236;&#xFF0C;&#x5E76;&#x4EE5;&#x5176;&#x540D;&#x79F0;&#x8FDB;&#x884C;<code>sparkling</code>&#x64CD;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5C06;&#x8BE5;&#x7C7B;&#x79F0;&#x4E3A;<code>sparkle</code>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x505A;&#x7684;&#x662F;&#x786E;&#x4FDD;&#x83B7;&#x53D6;&#x5927;&#x5C0F;&#x548C;&#x9AD8;&#x5EA6;&#xFF0C;&#x4E0D;&#x662F;&#x4ECE;&#x753B;&#x5E03;&#x83B7;&#x53D6;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x5143;&#x7D20;&#x83B7;&#x53D6;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x5927;&#x5C0F;&#x66F4;&#x65B0;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x8981;&#x5728;&#x8FD9;&#x91CC;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;JavaScript&#x4EE3;&#x7801;&#xFF0C;&#x5728;Codepen&#x4E2D;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;PenID&#x3002;&#x8FD9;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#x3002;&#x6211;&#x5F97;&#x6CE8;&#x518C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x624D;&#x80FD;&#x83B7;&#x53D6;css.ache t.worklet.Module&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#x4F1A;&#x5F00;&#x59CB;&#x76D1;&#x542C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x6211;&#x8981;&#x628A;&#x5B83;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7A7A;&#x683C;&#x91CC;&#x9762;&#xFF0C;&#x6BCF;&#x4E00;&#x5757;&#x7A7A;&#x683C;&#xFF0C;&#x6211;&#x90FD;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x80CC;&#x666F;&#x6765;&#x7ED8;&#x5236;&#x706B;&#x82B1;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x706B;&#x82B1;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5F97;&#x5237;&#x65B0;&#x4E00;&#x4E0B;&#x624D;&#x80FD;&#x8BA9;&#x5B83;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E0D;&#x597D;&#x4E86;&#xFF01;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x597D;&#x7684;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x3002;&#x597D;&#x7684;&#xFF0C;&#x6CE8;&#x518C;&#x6211;&#x4EEC;&#x7684;worklet&#x3002;</p>
<p>&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6B64;&#x811A;&#x672C;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;HTML&#x4E2D;&#x3002;CSS&#x7ED8;&#x5236;worklet&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x5230;&#x6211;&#x4EEC;&#x5F53;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x540D;&#x79F0;&#x7684;&#x56FE;&#x5757;&#x4E0A;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x662F;&#x884C;&#x4E0D;&#x901A;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5C0F;&#x542F;&#x52A8;&#x5668;&#x4E2D;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x7ED9;&#x4F60;&#x770B;&#x770B;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6709;&#x540E;&#x63F4;&#xFF01;[&#x638C;&#x58F0;]&#x3002;&#x592A;&#x9177;&#x4E86;&#xFF01;[&#x638C;&#x58F0;]&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x73A9;&#x8FD9;&#x4E9B;&#x5E7B;&#x706F;&#x7247;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x9177;&#x7684;Codepen&#x4E00;&#x8D77;&#x73A9;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x5F97;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x4ECE;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x63D0;&#x53D6;&#x8F93;&#x5165;&#x5C5E;&#x6027;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>sparkle num</code>&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x5728;&#x52A8;&#x753B;&#x4E2D;&#x4E3A;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<code>sparkle</code>&#x7684;&#x5173;&#x952E;&#x5E27;&#x8BBE;&#x7F6E;&#x52A8;&#x753B;&#xFF0C;&#x6B63;&#x5728;&#x63D0;&#x53D6;&#x8FD9;&#x4E9B;&#x503C;&#x5E76;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x503C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x4F5C;&#x4E3A;&#x6211;&#x7684;&#x52A8;&#x753B;&#x7684;&#x7D20;&#x6750;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5DF2;&#x6CE8;&#x518C;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x63D2;&#x5165;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x90A3;&#x4E9B;&#x503C;-&#x5B83;&#x4E0D;&#x4F1A;&#x6BCF;&#x6B21;&#x90FD;&#x56DE;&#x5230;&#x90A3;&#x4E2A;&#x503C;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x6628;&#x5929;&#x5B66;&#x5230;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x8BB0;&#x5F97;&#x5F53;&#x6211;&#x63D0;&#x5230;&#x8FD9;&#x786E;&#x5B9E;&#x662F;CSS&#x4E2D;&#x7684;JavaScript&#x5417;&#xFF1F;&#x56E0;&#x6B64;&#x8C01;&#x521B;&#x5EFA;&#x4E86;houdini.rocks&#xFF0C;&#x4ED6;&#x521B;&#x5EFA;&#x4E86;&#x8FD9;&#x4E2A;&#x4EC5;&#x8BC4;&#x4F30;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x7684;worklet&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x57FA;&#x672C;&#x4E0A;&#x53EF;&#x4EE5;&#x5728;CSS&#x4E2D;&#x653E;&#x5165;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x5728;CSS&#x5185;&#x90E8;&#x5E94;&#x7528;&#x80CC;&#x666F;&#x7ED8;&#x753B;&#x3002;&#x5B83;&#x662F;&#x8D85;&#x7EA7;&#x5143;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x6B63;&#x5728;&#x7F16;&#x5199;JavaScript&#xFF0C;&#x6211;&#x60F3;&#x4F60;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5E94;&#x7528;&#x5B83;&#x3002;&#x6211;&#x60F3;&#x4F60;&#x4F1A;&#x559C;&#x6B22;&#x7684;&#x3002;</p>
<p>[&#x638C;&#x58F0;]&#x3002;&#x8C22;&#x8C22;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E9B;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5B83;&#x662F;&#x5BF9;&#x5206;&#x53F7;&#x654F;&#x611F;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4F60;&#x7684;&#x53D8;&#x91CF;&#x5FC5;&#x987B;&#x5728;&#x5B9E;&#x4F8B;&#x5316;&#x4E2D;&#x5B58;&#x5728;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x65E0;&#x6CD5;&#x83B7;&#x5F97;&#x8FD9;&#x4E9B;&#x9759;&#x6001;&#x5C5E;&#x6027;&#x5E76;&#x5728;&#x8FD9;&#x91CC;&#x5E94;&#x7528;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x628A;&#x5B83;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x5305;&#x542B;&#x5728;&#x5143;&#x7D20;&#x4E2D;&#xFF0C;&#x4F46;&#x4F60;&#x73B0;&#x5728;&#x4E0D;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x6211;&#x5F88;&#x4E50;&#x610F;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/39.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x6267;&#x884C;&#x8BE5;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x60F3;&#x8C08;&#x8C08;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x60C5;&#x3002;<a href="https://extra-css.netlify.com/" target="_blank">extra.css</a>&#x662F;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x7814;&#x7A76;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x5E93;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4F60;&#x4ECA;&#x5929;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;Houdini&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/40.jpg" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;CSS Houdini Paint API&#x5E93;&#xFF0C;&#x4F7F;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x66F4;&#x7279;&#x522B;&#x4E00;&#x4E9B;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x505A;&#x7684;&#x662F;&#x73A9;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x706B;&#x82B1;&#x6F14;&#x793A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x706B;&#x82B1;&#x7684;&#x6570;&#x91CF;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5BBD;&#x5EA6;&#x53D8;&#x91CF;&#x3001;&#x9AD8;&#x5EA6;&#x53D8;&#x91CF;&#x3001;&#x4F7F;&#x5B83;&#x4EEC;&#x66F4;&#x539A;&#x7684;&#x91CD;&#x91CF;&#x6765;&#x4F7F;&#x5B83;&#x4EEC;&#x53D8;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x6B64;&#x6247;&#x8D1D;&#x5F62;&#x8FB9;&#x6846;&#xFF0C;&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x6240;&#x9700;&#x7684;&#x4EFB;&#x4F55;&#x989C;&#x8272;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x6325;&#x5176;&#x91CD;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x5904;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;&#x5F53;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#x65F6;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#xFF1F;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x8D85;&#x7EA7;&#x4E0B;&#x5212;&#x7EBF;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x4E0B;&#x5212;&#x7EBF;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0B;&#x5212;&#x7EBF;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0B;&#x5212;&#x7EBF;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x4E2D;&#x73A9;&#x4E00;&#x70B9;&#x6709;&#x4E50;&#x8DA3;&#x7684;&#x3002;&#x6709;&#x4E00;&#x4E2A;&#x5212;&#x7EBF;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x6B64;&#x989C;&#x8272;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x6B64;&#x5212;&#x7EBF;&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x6539;&#x4E94;&#x5F69;&#x7EB8;&#x5C51;&#xFF0C;&#x8C01;&#x4E0D;&#x559C;&#x6B22;&#x4E94;&#x5F69;&#x7EB8;&#x5C51;&#xFF1F;&#x4E94;&#x5F69;&#x7EB8;&#x5C51;&#x662F;&#x6DFB;&#x52A0;&#x5230;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#x4E2D;&#x7684;&#x4E00;&#x4EF6;&#x6709;&#x8DA3;&#x7684;&#x5C0F;&#x4E8B;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5916;&#x89C2;&#x3002;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x6B21;CDN&#x4FA6;&#x542C;&#x6765;&#x8BBE;&#x7F6E;&#x5B83;&#xFF0C;&#x73B0;&#x5728;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6B64;&#x793A;&#x4F8B;&#x7684;HTML&#x5185;&#x90E8;&#xFF0C;&#x6211;&#x5C06;&#x5173;&#x95ED;&#x8BE5;&#x7ED3;&#x679C;&#x3002;&#x6211;&#x6B63;&#x5728;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5C06;&#x5DE5;&#x4F5C;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x6587;&#x4EF6;&#x5305;&#x62EC;&#x5728;&#x5185;&#xFF0C;&#x5411;&#x6211;&#x6628;&#x5929;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x5DE5;&#x4F5C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8D21;&#x732E;&#x8005;&#x5927;&#x558A;&#x4E00;&#x58F0;&#x3002;&#x8036;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x5305;&#x62EC;&#x4F60;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x4F60;&#x7684;CSS&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x8986;&#x76D6;&#x5B83;&#x4EEC;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x53EA;&#x4F7F;&#x7528;&#x80CC;&#x666F;&#x753B;&#xFF0C;&#x5B83;&#x5C06;&#x91C7;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x524D;&#x9762;&#x7ED9;&#x4F60;&#x770B;&#x7684;&#x90A3;&#x6837;&#x3002;&#x6709;&#x4E86;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;Houdini&#x73B0;&#x5728;Chrome&#x7A33;&#x5B9A;&#x7248;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x5C06;&#x6765;&#x7684;Edge&#x4E2D;&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x5728;&#x4E0A;&#x9762;&#x6D4B;&#x8BD5;&#x8FD9;&#x4E9B;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x975E;&#x5E38;&#x9177;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x5C06;&#x6765;&#x80FD;&#x770B;&#x5230;&#x66F4;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/41.jpg" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F1F;&#x5927;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x7ED9;&#x4E88;&#x5F00;&#x53D1;&#x8005;&#x5982;&#x6B64;&#x591A;&#x7684;&#x63A7;&#x5236;&#x98CE;&#x683C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x4EE5;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5982;Aga&#x6240;&#x8BF4;&#xFF0C;&#x6211;&#x4F1A;&#x4E3A;&#x64AD;&#x5BA2;&#x7684;&#x6BCF;&#x4E2A;&#x542C;&#x4F17;&#x5531;&#x6B4C;&#x3002;&#x6211;&#x4EE5;&#x4E3A;&#x6211;&#x4F1A;&#x4EE5;&#x4E00;&#x70B9;&#x70B9;&#x7ED3;&#x675F;&#x3002;&#x6211;&#x60F3;&#x6211;&#x5E94;&#x8BE5;&#x7528;&#x4E00;&#x9996;&#x5C0F;&#x66F2;&#x6765;&#x7ED3;&#x675F;&#x8FD9;&#x4E00;&#x5207;&#x3002;&#x80FD;&#x7ED9;&#x6211;&#x70B9;&#x97F3;&#x4E50;&#x5417;&#xFF1F;[&#x7535;&#x5B50;&#x94A2;&#x7434;&#x97F3;&#x4E50;]&#x6211;&#x8FD9;&#x4E48;&#x505A;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x5927;&#x5BB6;&#x5FEB;&#x4E50;&#x3002;</p>
<blockquote>
<p>&#x6B4C;&#x8BCD;&#x7FFB;&#x8BD1;</p>
</blockquote>
<ul>
<li>&#x8BD5;&#x8BD5;&#x770B;&#x3002;</li>
<li>&#x4F7F;&#x7528;Stylus&#x8BBF;&#x95EE;&#x7F51;&#x7AD9;&#x3002;</li>
<li>&#x751A;&#x81F3;&#x51E0;&#x4E4E;&#x4E0E;&#x672C;&#x5730;&#x4EBA;&#x4E00;&#x6837;&#x3002;</li>
<li>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x3002;</li>
<li>&#x8C22;&#x8C22;&#x5927;&#x5BB6;&#x5728;&#x7F51;&#x4E0A;&#x65E9;&#x5B89;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4E0D;&#x660E;&#x767D;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x6559;&#x4F1A;&#x4E86;&#x6211;&#x7231;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x6559;&#x6211;&#x5EFA;&#x7ACB;&#x8010;&#x5FC3;&#x3002;</li>
<li>&#x73B0;&#x5728;&#x6211;&#x7684;&#x753B;&#x770B;&#x8D77;&#x6765;&#x68D2;&#x6781;&#x4E86;&#x3002;</li>
<li>&#x6211;&#x5B66;&#x4F1A;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x5206;&#x4EAB;&#x4E86;&#x3002;</li>
<li>&#x4F46;&#x8BF7;&#x4E0D;&#x8981;&#x770B;&#x5B83;&#x3002;</li>
<li>&#x6539;&#x53D8;&#x6280;&#x672F;&#x662F;&#x4E00;&#x79CD;&#x4E60;&#x60EF;&#x3002;</li>
<li>&#x5BF9;&#x6B64;&#xFF0C;&#x6211;&#x8BF4;&#x3002;&#x8C22;&#x8C22;&#xFF0C;&#x4E0B;&#x6B21;&#x89C1;&#xFF01;</li>
</ul>
<blockquote>
<p>&#x8C22;&#x8C22;&#xFF01;[&#x6B22;&#x547C;&#x548C;&#x638C;&#x58F0;]&#x3002;</p>
</blockquote>
<p><img src="https://yylifen.github.io/2019.jsconf/images/1/42.jpg" alt=""></p>
<ul>
<li><a href="https://twitter.com/una" target="_blank">Twitter @una</a></li>
<li><a href="https://github.com/una" target="_blank">Github @una</a></li>
<li><a href="http://una.im/" target="_blank">Website una.im</a></li>
</ul>
<p><a href="https://2019.jsconf.eu/una-kravets/css-houdini-and-the-future-of-styling.html" target="_blank">&#x6F14;&#x8BB2;&#x7A3F;&#x539F;&#x6587;&#x5730;&#x5740; https://2019.jsconf.eu/una-kravets/css-houdini-and-the-future-of-styling.html</a></p>
<p>&#x7FFB;&#x8BD1;&amp;&#x6821;&#x9A8C;&#xFF1A;<a href="https://github.com/yylifen" target="_blank">freedom</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"CSS Houdini和样式的未来","level":"1.2.1","depth":2,"next":{"title":"2.Sher Minn Chong","level":"1.3","depth":1,"ref":"","articles":[{"title":"用JS重新创造计算机复古艺术","level":"1.3.1","depth":2,"path":"speakers/SherMinnChong.md","ref":"speakers/SherMinnChong.md","articles":[]}]},"previous":{"title":"1.Una Kravets","level":"1.2","depth":1,"ref":"","articles":[{"title":"CSS Houdini和样式的未来","level":"1.2.1","depth":2,"path":"speakers/UnaKravets.md","ref":"speakers/UnaKravets.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"speakers/UnaKravets.md","mtime":"2019-10-16T10:46:33.960Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-10-18T11:28:19.440Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

